export function TermsDefinitions() {
  return (
    <>
      <h2 className="mb-2 font-medium">1. Терміни та визначення</h2>
      <p className="mb-1">
        У цих Правилах, якщо контекст не потребує іншого, нижченаведені терміни мають наступне
        значення:
      </p>
      <ul className="list-disc pl-4">
        <li className="mb-1">
          «<span className="font-medium">Постачальник послуг</span>» – фізична особа-підприємець
          {process.env.NEXT_PUBLIC_FOP_INOF}.&nbsp; Після прийняття (акцепту) пропозиції Надавач
          послуг виступає стороною договору як Продавць.
        </li>
        <li className="mb-1">
          «<span className="font-medium">Додаток/Сайт/Платформа</span>» – сайт, на якому розміщена
          інформація про товари, роботи, послуги, умови їх придбання, оплати, доставки, акції,
          заходи рекламного та маркетингового характеру, інша загальна інформація, інша інформація,
          що є обов’язковою, в графічному та/або текстовому викладенні, адресована невизначеному
          колу осіб, на підставі якої будь-яка особа може здійснити свідомий вибір та звернутися до
          Товариства з офертою про укладення роздрібного договору купівлі-продажу товарів на умовах,
          викладених в даних Правилах.
        </li>
        <li className="mb-1">
          <span className="font-medium">«Користувач»/ «Покупець»</span> – повнолітня, дієздатна
          фізична особа, що зайшла на платформу та продовжує користуватися ним на умовах, визначених
          в цих Правилах.
        </li>
        <li className="mb-1">
          <span className="font-medium">«Отримувач»</span> – третя особа, яка є повнолітньою,
          дієздатною фізичною особою, яку Користувач в ході оформлення замовлення позначив в якості
          безпосереднього отримувача Товару.
        </li>
        <li className="mb-1">
          <span className="font-medium">«Оферта»</span> – вибір Користувачем від однієї позиції із
          переліку товарів/робіт/послуг, розміщених на Сайті, шляхом додавання обраного товару в
          «кошик», подальшого введення інформації, необхідної для оформлення замовлення, та
          натискання кнопки «оформити замовлення» (далі також - оформлення замовлення)
        </li>
        <li className="mb-1">
          <span className="font-medium">«Товар»</span> - валізи, сумки, гаманці, аксесуари до валіз,
          косметички, сумки на колесах супроводжувальні предмети, інформація про які розміщена на
          Сайті.
        </li>
        <li className="mb-1">
          <span className="font-medium">«Робота/послуга»</span> - роботи/послуги, що зазвичай
          споживаються в момент їх виконання чи надання, інформація про які розміщена на Сайті.
        </li>
        <li className="mb-1">
          <span className="font-medium">«Авторизація»</span> - отримання Постачальником Послуг
          даних, в тому числі персональних, Користувача під час відвідування Сайту та/або в процесі
          направлення оферти (оформлення замовлення). Сторони використовують одноразовий
          ідентифікатор для підпису правочину. Авторизація під час знаходження на Сайті здійснюється
          Користувачем автоматично та є обов’язковою.
        </li>
        <li className="mb-1">
          <span className="font-medium">«Верифікація Користувача»</span> - встановлення
          (підтвердження) Постачальником Послуг відповідності особи Користувача у його присутності
          отриманим на Сайті ідентифікаційним даним.
        </li>
      </ul>
    </>
  )
}
