export function PersonalData() {
  const appURL = 'rtkstore.org'

  return (
    <>
      <h2 className="mb-2 text-lg font-medium">Положення про обробку персональних даних</h2>

      <p className="text-lg font-medium">Зміст</p>

      <ul className="list-decimal pl-6">
        <li>Загальні положення та сфера застосування.</li>
        <li>Склад, зміст та джерела збирання персональних даних.</li>
        <li>Мета, підстави та строки обробки персональних даних.</li>
        <li>Місцезнаходження персональних даних.</li>
        <li>Доступ до персональних даних.</li>
        <li>Передача персональних даних третім особам.</li>
        <li>Заходи захисту персональних даних.</li>
        <li>Права Покупців як суб’єкта персональних даних.</li>
        <li>
          Порядок роботи з запитами Покупця та третіх осіб щодо доступу до персональних даних.
        </li>
        <li>Видалення персональних даних Покупця.</li>
        <li>Відкликання згоди на обробку персональних даних.</li>
        <li>Персональні дані одержувачів замовлення.</li>
        <li>Внесення змін до Положення.</li>
      </ul>

      <p className="text-lg font-medium">1. Загальні положення та сфера застосування</p>

      <p>
        Постачальник послуг обробляє персональні дані фізичних осіб, які здійснюють купівлю та/або
        замовлення товарів та/або послуг для себе, одержувачів замовлення, а також відвідувачів
        Платформи &quot;{process.env.NEXT_PUBLIC_APP_NAME}&quot; яка включає веб-сайт: {appURL}{' '}
        та/або пов&apos;язані сервіси, відповідно до цього Положення про обробку і захист
        персональних даних користувачів (покупців) онлайн-платформи &quot;
        {process.env.NEXT_PUBLIC_APP_NAME}&quot; (надалі – &quot;Положення&quot;).
      </p>

      <p>Постачальник послуг є володільцем персональних даних Покупців.</p>

      <p>
        Персональні дані у цьому Положенні означають відомості чи сукупність відомостей про фізичну
        особу, яка ідентифікована або може бути конкретно ідентифікована.
      </p>

      <p>
        Обробка Постачальником послуг персональних даних Покупців/Клієнті включає, але не
        обмежується, наступні дії: збирання, реєстрація, накопичення, зберігання, адаптування,
        зміна, поновлення, використання і поширення (розповсюдження, реалізація, передача),
        знеособлення, знищення персональних даних, у тому числі з використанням інформаційних
        (автоматизованих) систем.
      </p>

      <p>
        Інші терміни у цьому Положенні використовуються у значеннях, наведених у Законі України
        &quot;Про захист персональних даних&quot; від 01 червня 2010 року № 2297-VI.
      </p>

      <p>
        Здійснюючи Авторизацію в Додатку та починаючи використання Патформи, або оформлюючи
        замовлення без попередньої реєстрації, Покупець надає дозвіл та добровільну однозначну згоду
        на обробку його персональних даних на умовах та в порядку, що викладені у цьому Положенні, а
        також підтверджує, що уважно ознайомився та повністю зрозумів це Положення.
      </p>

      <p>
        На Сайті можуть бути посилання на інші веб-сайти (виключно в інформаційних цілях). При
        переході за посиланнями на інші веб-сайти дія цього Положення на такі веб-сайти не
        поширюватиметься. У зв&apos;язку з чим, Постачальник послуг рекомендує ознайомлюватися з
        політикою в сфері конфіденційності та персональних даних кожного такого веб-сайту перед тим,
        як передавати персональні дані, за якими Покупець можете бути ідентифікований.
      </p>

      <p>
        На Платформі можуть створюватись окремі кабінети користувача, в тому числі для зручності
        авторизації та формування замовлень, швидкості оформлення замовлень та оплати товарів.
      </p>
    </>
  )
}
