export function ForceMajeureTerms() {
  return (
    <>
      <h2 className="mb-2 font-medium">3. Обставини непереборної сили (форс-мажор)</h2>

      <p>
        <span className="font-medium">3.1</span> Постачальник Послуг та Користувач не несуть
        відповідальності за невиконання будь-якого з положень, якщо доведуть, що таке невиконання
        було викликано форс-мажорними обставинами, тобто подіями або обставинами, що дійсно
        знаходяться поза їх контролем, що носять непередбачений і невідворотний характер.
      </p>

      <p>
        <span className="font-medium">3.2</span> До форс-мажорних обставин належать, зокрема, але не
        виключно, природні катаклізми, страйки, пожежі, повені, вибухи, обмерзання, війни (як
        оголошені, так і неоголошені), оголошення воєнного стану або надзвичайних ситуацій,
        проведення антитерористичних операцій (як оголошених, так і неоголошених), епідемії,
        епізоотії, введення повного чи обмеженого карантину, режиму надзвичайної ситуації,
        надзвичайного стану, введення локдаунів, заборон чи обмеження здійснення певних видів
        господарської діяльності, заколоти, загибель товару, затримки перевізників, викликані
        аваріями або несприятливими погодними умовами, небезпеки і випадковості на морі, ембарго,
        катастрофи, обмеження, що накладаються державними органами (включаючи розподілу, пріоритети,
        офіційні вимоги, квоти і ціновий контроль), якщо ці обставини безпосередньо вплинули на
        виконання прийнятих зобов’язань.
      </p>

      <p>
        <span className="font-medium">3.3</span> Особа, для якої стало неможливим виконання
        зобов&lsquo;язань через настання форс-мажорних обставин, повинна негайно інформувати іншу
        сторону.
      </p>
    </>
  )
}
