import { Box } from '@/components/ui/box'

export function GeneralTerms() {
  return (
    <Box className="my-4 font-medium">
      <h2 className="mb-2">2. Загальні умови</h2>
      <p>
        2.1. Залишаючись на Платформі Користувач приймає умови та порядок направлення оферти
        Постачальнику Послуг (оформлення замовлення) та акцептування Постачальником Послуг оферти, а
        також надає Постачальнику Послуг згоду на обробку наданих ним персональних даних та інших
        відомостей, які вважає за необхідне надати, або які є обов’язковими для надання за
        Законодавством, а також приймає умови відповідальності за недобросовісне використання
        Платформи.
      </p>
      <p>
        2.2. Постачальник Послуг попереджає, що Користувач - фізична особа для нього є завжди такою,
        що має дієздатність та є повнолітньою. Оцінка повноліття та дієздатності є завжди
        суб’єктивною. Товариство не вимагає надання документів, що підтверджує відсутність
        дієздатності або досягнення фізичною особою 18 років. Цивільне законодавство дозволяє
        укладати правочини щодо придбання товарів для дрібного побуту. Для уникнення ситуацій, коли
        неповнолітня або недієздатна особа користується Сайтом, оформлює замовлення, направляє
        оферту на умовах, викладених в цих Правилах, та в майбутньому, її законний представник
        заперечує такі операції, Товариство вважає за необхідне попередити, що для нього такі
        операції будуть вважатися вчиненими особою без будь-яких обмежень, тобто законні
        представники мають самостійно забезпечити такі дії, які будуть достатніми для запобігання
        вчинення неповнолітніми/недієздатними/обмежено дієздатними особами дій, що описані вище.
      </p>
      <p>
        2.3. Всі дії, вчинені особою на платформі, в тому числі направлена оферта, мають на меті
        укладення договору купівлі-продажу товарів, робіт, послуг для цілей, не пов’язаних з
        підприємницькою діяльністю і, відповідно, в подальшому така особа не має права вимагати
        надання їй будь-яких документів, надання яких не передбачено для фізичної особи. За
        зверненням юридичної особи або фізичної особи-підприємця операції що до її обслуговування
        розглядаються окремо.
      </p>
      <p>
        2.4. Постачальник Послуг повідомляє, що опис товарів, розміщений на Сайті, в тому числі
        ціни, позначені на Cайті, можуть змінюватись. Остаточною є ціна, вказана в акцепті,
        направленому у відповідь на оферту Користувача (підтвердження замовлення). Будь-яка
        інформація про товар, що міститься на Сайті, розміщена, у тому числі, на підставі технічної
        та іншої інформації, наданої виробником товару. У випадку виявлення розбіжностей в
        інформації, зазначеній на Сайті та в документах виробника, Користувач має керуватися даними
        документів виробника товарів. Товариство має право в будь-який час вносити зміни в
        інформацію, розміщену на Сайті, без попереднього повідомлення Користувачів.
      </p>
      <p>
        2.5. Постачальник Послуг повідомляє Користувача, що обрання та користування товаром, є
        відповідальною дією. Користувач має впевнитись, що всі вимоги щодо експлуатації товару ним
        дотримано.
      </p>
      <p>
        2.6. Користувач несе відповідальність за достовірність вказаної при направленні оферти
        (оформленні замовлення) інформації. При цьому, Користувач автоматично надає свою згоду
        Постачальнику Послуг на обробку своїх персональних даних, які додатково стали або стануть
        відомими Постачальнику Послуг в результаті прийняття (акцепту) оферти Користувача. Обробка
        включає, але не обмежується зазначеним: збирання, реєстрацію, накопичення, зберігання,
        адаптування, зміну, поновлення, використання і поширення (включаючи передачу), знеособлення,
        знищення персональних даних, з метою ведення бази персональних даних покупців, у тому числі
        Постачальник Послуг отримує право здійснювати опитування Користувача через засоби зв’язку,
        Постачальнику Послуг або відомі Постачальнику Послуг, стосовно якості товарів/робіт/послуг,
        запрошення до участі у рекламних та маркетингових заходах, здійснювати інформування
        Користувача через засоби зв’язку Користувача, надані Постачальнику послуг або відомі
        Постачальнику послуг, щодо результатів розгляду його звернень, повідомлення щодо акцій,
        пропозицій, рекламних матеріалів, діяльності Постачальника послуг. Користувач погоджується,
        що Постачальник послуг не має отримувати жодної додаткової згоди Користувача для передачі
        персональних даних Користувача, будь-які інші форми отримання згоди Користувача не
        передбачаються. Користувач має право в будь-який час відмовитися від розсилок (реклами,
        маркетингових повідомлень), повідомивши про це у відповідному Додатку або відписавшись від
        розсилки шляхом направлення у позначеному місті електронного повідомлення зворотного листа з
        власної адреси електронної пошти. Користувач має право відмовитись від згоди на обробку
        персональних даних, проте, розуміє, що Товариство буде зберігати таку інформацію в рамках
        податкового та іншого застосовного законодавства.
      </p>
      <p>
        2.7. Постачальник послуг не проводить верифікацію даних (інформації), наданих Користувачем
        під час авторизації на Сайті. Вся інформація, надана Користувачем під час авторизації на
        Сайті приймається Товариством без будь-якою додаткової перевірки та є підставою для
        оформлення документів, необхідних в ході акцепту оферти.
      </p>
      <p>
        2.8. Використання Додатку для перегляду товарів/послуг, а також для оформлення замовлення є
        для Користувача безоплатним. Умови доступу до Мережі Інтернет регулюються окремим договором
        між Користувачем та його Інтернет-провайдером без втручання оферента (Постачальника послуг).
      </p>
      <p>
        2.9. Платформа та сервіси, що надаються Сайтом, можуть бути тимчасово частково або повністю
        недоступними з причин проведення профілактичних, регламентних, інших технічних робіт.
      </p>
      <p>
        2.10. Постачальник послуг залишає за собою право в односторонньому порядку вносити зміни в
        ці Правила з попередньою публікацією його на Сайті.
      </p>
      <p>
        2.11. Визнання судом України недійсним окремих положень цих Правил не призводить до
        недійсності цих Правил в цілому сенсі.
      </p>
      2.12. На Платформі {process.env.NEXT_PUBLIC_APP_NAME} є або можуть бути інші договори
      (правила), що регулюють окремі взаємовідносини.
    </Box>
  )
}
